app/controllers/users_controller.rb

  def index
    @users = User.paginate(page: params[:page], per_page: 10)
---
SELECT  `users`.* FROM `users` LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM `users`

  def update
    if @user.update(user_params)
---
UPDATE `users` SET `password_digest` = '$2a$12$1Fth0savtiEYjk1oeotn5uNmKSmJVhgmiLgYmyO4b5L/GzGyR3O16' WHERE `users`.`id` = 1