app/models/user.rb

INSERT INTO `relationships` (`follower_id`, `followed_id`, `created_at`, `updated_at`) VALUES (1, 3, '2019-11-12 02:25:54', '2019-11-12 02:25:54')
---
  def follow(other_user)
    active_relationships.create(followed_id: other_user.id)

DELETE FROM `relationships` WHERE `relationships`.`id` = 88
---
  def unfollow(other_user)
    active_relationships.find_by(followed_id: other_user.id).destroy